<a href="https://colab.research.google.com/github/mandem296/SQLite-Chinook/blob/main/SQL_%26_PowerBi_Challenges.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# **CHALLENGES**

## **Week 1 Daily Challenges**

### **Day 1: Develop database called ABC_DATA and use it to store:**

*   Customer info
*   Customer orders
*   Product info
*   Order Info

In [1]:
!pip install pymysql

Collecting pymysql
  Downloading PyMySQL-1.1.0-py3-none-any.whl (44 kB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 44.8/44.8 kB 1.3 MB/s eta 0:00:00
Installing collected packages: pymysql
Successfully installed pymysql-1.1.0

In [2]:
%load_ext sql

In [3]:
#Creating the database
%sql sqlite:///ABC_DATA.db

In [4]:
#creating the customers info table

%%sql

CREATE TABLE customers_info (
  customer_id integer PRIMARY KEY,
  customer_first_name varchar(100),
  customer_last_name varchar(100),
  customer_email varchar(100)
);

 * sqlite:///ABC_DATA.db
Done.

[]

In [5]:
#creating the products table

%%sql

CREATE TABLE products (
  product_id integer PRIMARY KEY,
  product_name varchar(100),
  price float(4)
);

 * sqlite:///ABC_DATA.db
Done.

[]

In [6]:
#creating the orders table

%%sql

CREATE TABLE orders (
  order_id integer PRIMARY KEY,
  customer_id integer,
  order_date DATE
);

 * sqlite:///ABC_DATA.db
Done.

[]

In [7]:
#creating the Order_items table

%%sql

CREATE TABLE order_items (
  order_id integer,
  product_id integer,
  quantity integer
);

 * sqlite:///ABC_DATA.db
Done.

[]

In [8]:
#Listing all column names in a particular table. We are looking at the schema

%%sql

PRAGMA table_info(customers_info)

 * sqlite:///ABC_DATA.db
Done.

[(0, 'customer_id', 'INTEGER', 0, None, 1),
 (1, 'customer_first_name', 'varchar(100)', 0, None, 0),
 (2, 'customer_last_name', 'varchar(100)', 0, None, 0),
 (3, 'customer_email', 'varchar(100)', 0, None, 0)]

In [9]:
#Listing all column names in a particular table. We are looking at the schema

%%sql

PRAGMA table_info(products)

 * sqlite:///ABC_DATA.db
Done.

[(0, 'product_id', 'INTEGER', 0, None, 1),
 (1, 'product_name', 'varchar(100)', 0, None, 0),
 (2, 'price', 'float(4)', 0, None, 0)]

In [10]:
#Listing all column names in a particular table. We are looking at the schema

%%sql

PRAGMA table_info(orders)

 * sqlite:///ABC_DATA.db
Done.

[(0, 'order_id', 'INTEGER', 0, None, 1),
 (1, 'customer_id', 'INTEGER', 0, None, 0),
 (2, 'order_date', 'DATE', 0, None, 0)]

In [11]:
#Listing all column names in a particular table. We are looking at the schema

%%sql

PRAGMA table_info(order_items)

 * sqlite:///ABC_DATA.db
Done.

[(0, 'order_id', 'INTEGER', 0, None, 0),
 (1, 'product_id', 'INTEGER', 0, None, 0),
 (2, 'quantity', 'INTEGER', 0, None, 0)]

In [12]:
#shows tables contained in the Chinook Database
%%sql
SELECT name FROM sqlite_master WHERE type IN ('table','view') AND name NOT LIKE 'sqlite_%' ORDER BY 1

 * sqlite:///ABC_DATA.db
Done.

[('customers_info',), ('order_items',), ('orders',), ('products',)]

### **Day 2: Inserting data into the tables**

In [13]:
%%sql

    INSERT INTO products (product_id, product_name, price) VALUES
    (1, 'Product A', 10.00),
    (2, 'Product B', 15.00),
    (3, 'Product C', 20.00),
    (4, 'Product D', 25.00),
    (5, 'Product E', 30.00),
    (6, 'Product F', 35.00),
    (7, 'Product G', 40.00),
    (8, 'Product H', 45.00),
    (9, 'Product I', 50.00),
    (10, 'Product J', 55.00),
    (11, 'Product K', 60.00),
    (12, 'Product L', 65.00),
    (13, 'Product M', 70.00);

    INSERT INTO orders (order_id, customer_id, order_date) VALUES
    (1, 1, '2023-05-01'),
    (2, 2, '2023-05-02'),
    (3, 3, '2023-05-03'),
    (4, 1, '2023-05-04'),
    (5, 2, '2023-05-05'),
    (6, 3, '2023-05-06'),
    (7, 4, '2023-05-07'),
    (8, 5, '2023-05-08'),
    (9, 6, '2023-05-09'),
    (10, 7, '2023-05-10'),
    (11, 8, '2023-05-11'),
    (12, 9, '2023-05-12'),
    (13, 10, '2023-05-13'),
    (14, 11, '2023-05-14'),
    (15, 12, '2023-05-15'),
    (16, 13, '2023-05-16');

    INSERT INTO order_items (order_id, product_id, quantity) VALUES
    (1, 1, 2),
    (1, 2, 1),
    (2, 2, 1),
    (2, 3, 3),
    (3, 1, 1),
    (3, 3, 2),
    (4, 2, 4),
    (4, 3, 1),
    (5, 1, 1),
    (5, 3, 2),
    (6, 2, 3),
    (6, 1, 1),
    (7, 4, 1),
    (7, 5, 2),
    (8, 6, 3),
    (8, 7, 1),
    (9, 8, 2),
    (9, 9, 1),
    (10, 10, 3),
    (10, 11, 2),
    (11, 12, 1),
    (11, 13, 3),
    (12, 4, 2),
    (12, 5, 1),
    (13, 6, 3),
    (13, 7, 2),
    (14, 8, 1),
    (14, 9, 2),
    (15, 10, 3),
    (15, 11, 1),
    (16, 12, 2),
    (16, 13, 3);

 * sqlite:///ABC_DATA.db
13 rows affected.
16 rows affected.
32 rows affected.

[]

In [14]:
%%sql

INSERT INTO customers_info (customer_id, customer_first_name, customer_last_name, customer_email) VALUES
    (1, 'John', 'Doe', 'johndoe@email.com'),
    (2, 'Jane', 'Smith', 'janesmith@email.com'),
    (3, 'Bob', 'Johnson', 'bobjohnson@email.com'),
    (4, 'Alice', 'Brown', 'alicebrown@email.com'),
    (5, 'Charlie', 'Davis', 'charliedavis@email.com'),
    (6, 'Eva', 'Fisher', 'evafisher@email.com'),
    (7, 'George', 'Harris', 'georgeharris@email.com'),
    (8, 'Ivy', 'Jones', 'ivyjones@email.com'),
    (9, 'Kevin', 'Miller', 'kevinmiller@email.com'),
    (10, 'Lily', 'Nelson', 'lilynelson@email.com'),
    (11, 'Oliver', 'Patterson', 'oliverpatterson@email.com'),
    (12, 'Quinn', 'Roberts', 'quinnroberts@email.com'),
    (13, 'Sophia', 'Thomas', 'sophiathomas@email.com');

 * sqlite:///ABC_DATA.db
13 rows affected.

[]

In [15]:
%%sql

SELECT *

FROM customers_info

 * sqlite:///ABC_DATA.db
Done.

[(1, 'John', 'Doe', 'johndoe@email.com'),
 (2, 'Jane', 'Smith', 'janesmith@email.com'),
 (3, 'Bob', 'Johnson', 'bobjohnson@email.com'),
 (4, 'Alice', 'Brown', 'alicebrown@email.com'),
 (5, 'Charlie', 'Davis', 'charliedavis@email.com'),
 (6, 'Eva', 'Fisher', 'evafisher@email.com'),
 (7, 'George', 'Harris', 'georgeharris@email.com'),
 (8, 'Ivy', 'Jones', 'ivyjones@email.com'),
 (9, 'Kevin', 'Miller', 'kevinmiller@email.com'),
 (10, 'Lily', 'Nelson', 'lilynelson@email.com'),
 (11, 'Oliver', 'Patterson', 'oliverpatterson@email.com'),
 (12, 'Quinn', 'Roberts', 'quinnroberts@email.com'),
 (13, 'Sophia', 'Thomas', 'sophiathomas@email.com')]

In [16]:
%%sql

SELECT *

FROM products

 * sqlite:///ABC_DATA.db
Done.

[(1, 'Product A', 10.0),
 (2, 'Product B', 15.0),
 (3, 'Product C', 20.0),
 (4, 'Product D', 25.0),
 (5, 'Product E', 30.0),
 (6, 'Product F', 35.0),
 (7, 'Product G', 40.0),
 (8, 'Product H', 45.0),
 (9, 'Product I', 50.0),
 (10, 'Product J', 55.0),
 (11, 'Product K', 60.0),
 (12, 'Product L', 65.0),
 (13, 'Product M', 70.0)]

In [17]:
%%sql

SELECT *

FROM orders

 * sqlite:///ABC_DATA.db
Done.

[(1, 1, '2023-05-01'),
 (2, 2, '2023-05-02'),
 (3, 3, '2023-05-03'),
 (4, 1, '2023-05-04'),
 (5, 2, '2023-05-05'),
 (6, 3, '2023-05-06'),
 (7, 4, '2023-05-07'),
 (8, 5, '2023-05-08'),
 (9, 6, '2023-05-09'),
 (10, 7, '2023-05-10'),
 (11, 8, '2023-05-11'),
 (12, 9, '2023-05-12'),
 (13, 10, '2023-05-13'),
 (14, 11, '2023-05-14'),
 (15, 12, '2023-05-15'),
 (16, 13, '2023-05-16')]

In [18]:
%%sql

SELECT *

FROM order_items

 * sqlite:///ABC_DATA.db
Done.

[(1, 1, 2),
 (1, 2, 1),
 (2, 2, 1),
 (2, 3, 3),
 (3, 1, 1),
 (3, 3, 2),
 (4, 2, 4),
 (4, 3, 1),
 (5, 1, 1),
 (5, 3, 2),
 (6, 2, 3),
 (6, 1, 1),
 (7, 4, 1),
 (7, 5, 2),
 (8, 6, 3),
 (8, 7, 1),
 (9, 8, 2),
 (9, 9, 1),
 (10, 10, 3),
 (10, 11, 2),
 (11, 12, 1),
 (11, 13, 3),
 (12, 4, 2),
 (12, 5, 1),
 (13, 6, 3),
 (13, 7, 2),
 (14, 8, 1),
 (14, 9, 2),
 (15, 10, 3),
 (15, 11, 1),
 (16, 12, 2),
 (16, 13, 3)]